[
  {
    "id": 1,
    "title": "Dark Storm",
    "image": "1.jpg",
    "genre": "drama",
    "rating": "8.3",
    "description": "A gripping tale of a city torn by secrets and sorrow, where a journalist uncovers the truth behind a powerful storm of corruption."
  },
  {
    "id": 2,
    "title": "Whisper of Fate",
    "image": "2.jpg",
    "genre": "fantasy",
    "rating": "7.7",
    "description": "In a mystical land ruled by prophecy, a young healer discovers her destiny through whispers from the ancient spirits of the forest."
  },
  {
    "id": 3,
    "title": "Beyond the Edge",
    "image": "3.jpg",
    "genre": "horror",
    "rating": "6.3",
    "description": "After a group of hikers cross a forbidden ridge, they descend into a realm where nightmares crawl out of the dark and sanity fades."
  },
  {
    "id": 4,
    "title": "Lost in Shadows",
    "image": "4.jpg",
    "genre": "action",
    "rating": "9.3",
    "description": "An elite agent betrayed by his unit must survive in a hostile underworld to uncover the truth and reclaim his life."
  },
  {
    "id": 5,
    "title": "Echoes of Power",
    "image": "5.jpg",
    "genre": "fantasy",
    "rating": "6.9",
    "description": "A young warrior finds an ancient relic that echoes with power—and danger—drawing him into a battle between forgotten gods."
  },
  {
    "id": 6,
    "title": "Grim Reckoning",
    "image": "6.jpg",
    "genre": "drama",
    "rating": "8.4",
    "description": "Haunted by his past, a former soldier returns home to confront the tragedy he left behind—and the justice still waiting."
  },
  {
    "id": 7,
    "title": "Fury's Flight",
    "image": "7.jpg",
    "genre": "action",
    "rating": "9.8",
    "description": "When a rogue pilot is framed for treason, she takes to the skies in a breathtaking mission to expose the truth and stop a global war."
  },
  {
    "id": 8,
    "title": "Path of the Forgotten",
    "image": "8.jpg",
    "genre": "action",
    "rating": "7.2",
    "description": "An underground resistance fighter must navigate a post-apocalyptic wasteland to reconnect with the people he once vowed to protect."
  },
  {
    "id": 9,
    "title": "Nightmare's Threshold",
    "image": "9.jpg",
    "genre": "horror",
    "rating": "1.7",
    "description": "When a sleep experiment goes wrong, five strangers awaken the doorway to an unspeakable nightmare that threatens to consume them all."
  },
  {
    "id": 10,
    "title": "Eternal Hunt",
    "image": "10.jpg",
    "genre": "fantasy",
    "rating": "7.5",
    "description": "In an ancient kingdom, a cursed prince must join a secret order of hunters to save his soul and break the cycle of eternal bloodshed."
  },
  {
    "id": 11,
    "title": "Legacy of the Void",
    "image": "11.jpg",
    "genre": "action",
    "rating": "8.5",
    "description": "A shadow operative discovers his family’s past is tied to a war that never ended—and he must finish it before it swallows the world."
  },
  {
    "id": 12,
    "title": "Shadow's Crescent",
    "image": "12.jpg",
    "genre": "horror",
    "rating": "7.5",
    "description": "A cursed lunar eclipse awakens an ancient evil, and only a fading scholar can decode the legends before the shadows consume reality."
  },
  {
    "id": 13,
    "title": "Crimson Dawn",
    "image": "13.jpg",
    "genre": "fantasy",
    "rating": "8.4",
    "description": "A rebellion rises as a forgotten bloodline reclaims its power during the crimson dawn—a celestial event that reshapes the world."
  },
  {
    "id": 14,
    "title": "Silent Kingdom",
    "image": "14.jpg",
    "genre": "fantasy",
    "rating": "6.5",
    "description": "In a realm where sound has vanished, a blind bard must unite a fractured empire using the forgotten language of silence."
  },
  {
    "id": 15,
    "title": "Mystic Rite",
    "image": "15.jpg",
    "genre": "fantasy",
    "rating": "9.8",
    "description": "Every hundred years, a chosen few undergo the mystic rite—but when the ritual is corrupted, the fate of reality itself is at stake."
  },
  {
    "id": 16,
    "title": "Reign of the Lost",
    "image": "16.jpg",
    "genre": "horror",
    "rating": "9.1",
    "description": "A lost civilization awakens beneath the Arctic ice, bringing with it horrors that defy time, death, and understanding."
  },
  {
    "id": 17,
    "title": "Timeless Myth",
    "image": "17.jpg",
    "genre": "drama",
    "rating": "4.0",
    "description": "An aging author struggles with fading fame as he revisits the mythical tale that once made him a legend—only to find the myth is real."
  },
  {
    "id": 18,
    "title": "Oath of the Fallen",
    "image": "18.jpg",
    "genre": "fantasy",
    "rating": "6.3",
    "description": "A disgraced knight makes a sacred oath to protect the last heir to a ruined kingdom, battling dark forces to fulfill his promise."
  },
  {
    "id": 19,
    "title": "Veil of Night",
    "image": "19.jpg",
    "genre": "drama",
    "rating": "9.5",
    "description": "In a city gripped by eternal twilight, a detective races to solve a series of murders that mirror his own mysterious past."
  },
  {
    "id": 20,
    "title": "Guardians of Twilight",
    "image": "20.jpg",
    "genre": "horror",
    "rating": "7.4",
    "description": "At the edge of dusk, when day and night collide, ancient guardians awaken to protect humanity from creatures lurking between worlds."
  }
]
